[
    {
        "title": "What are co-ops and internships?",
        "text": "They're opportunities for you to take time off your degree to go work at a company in a field relevant to your major. For computer science / software engineering students, you'd often be looking into software engineering internship opportunities."
    },
    {
        "title": "Why should I do them?",
        "text": "Graduating without work experience is a death sentence. It's hard, no one will hire you, we're in an oversaturated field, and you need a way to stand out. Get relevant experience in your undergrad so that when you graduate you have an easier time looking for jobs. Also, you'll be a better student and developer overall. \n\n I learned MUCH more in my software engineering internship than I ever did in my entire degree. To me, I hate academia. I want to graduate and get out of here. I taught myself more than my lectures did, and my internships taught me and gave me more experience than I could ask for. \n\n You can also make a lot of money working at large tech companies as an intern. There're incredible internships at companies like Google, Facebook, Jane Street, Citadel, Hudson River Trading, etc. that have insane pay - check https://www.levels.fyi/internships for yourself."
    },
    {
        "title": "How can I find my first internship?",
        "text": "The truth is that your first job search is always going to be the hardest. It's when you're more inexperienced and you're just looking for a company to take a chance on you. Once you get your first work experience down, you can use that momentum to strengthen your resume and get your 2nd, 3rd, 4th, etc. \n\n So, how can you go about getting your first internship? Have a strong resume, have a lot of public work people can view (eg. LinkedIn, personal projects on your GitHub, or even a portfolio website you made), and apply early, and apply to many! It helps if you know people working at companies so you can get referrals - going back to my point about making friends. I've had so many friends refer me to companies, it was great. \n\n One thing that might help your first job search is to be part of the Lassonde co-op program. Companies receive a tax break when they hire interns, so some companies will actually only hire interns that are part of an accredited co-op program. Some of these companies include CIBC, RBC, CaseWare, etc. - but when you get to a point in time of targetting larger companies like Amazon / Facebook, they don't care about the tax break (they're so rich they don't care to get the tax break). I was in the Lassonde co-op program for my first internship, then I left the program and pursued the bigger names on my own."
    },
    {
        "title": "How do I find jobs, where do I apply?",
        "text": "A mistake students make in their job search is thinking they're limited to the Lassonde job portal (which is not substantial whatsoever) or only searching 'Software Engineer Intern' on LinkedIn. There's two important components for job searching: when do you search, and how. For SUMMER internships, postings can open as early as July / August the prior year. For FALL internships, postings will open around March / April, and for WINTER internships, postings will be open around September / October. \n\n Summer is a very busy season - a lot of companies hire for summer only and have the most headcount. Fall and winter internships are generally what I call 'dead seasons'. It's possible to get internships for fall and winter, just much harder. The way I apply to jobs is I keep a long list of 100-200 tech companies, and around when internship season begins, I'll Google search '{company name} careers', go to their careers page, and apply on the company website. \n\n Most companies won't be shelling out money to post ads on LinkedIn as they know most people will go to their website to apply (and people do). Depending on the season you're looking for, Google '{season} internships GitHub repo' - there's usually a GitHub repo floating around every season that's updated as internship applications open up. Talk in friend groups as well. If you have a group of friends and you're all collectively trying to find internships together, make a group chat and discuss. Your friends might have applied to a posting you missed, and vice versa. \n\n Also, watch this YouTube video I made: https://www.youtube.com/watch?v=1RjP0Q58xfc"
    },
    {
        "title": "What I'm not ready to apply to jobs yet?",
        "text": "Honestly, suck it up. It takes ~15 seconds to apply to a job posting. Even if your resume / portfolio isn't ready, I always encourage applying just for practise and to get into the swing of recruiting cycles. If you do manage to get a few OAs or interviews, that's just free practise even if you think you won't pass. Who knows, maybe you can surprise yourself with an offer as well. \n\n The point is - who cares if you think you're 'not ready', it costs nothing to apply, it's practise, and you'll never be ready with that attitude. Stop kneecapping yourself and start applying to internships. \n\n TL;DR - if you don't apply to a job, it's a 0% chance you get the job. If you at least apply, it now becomes a non-zero chance. Might still be low, but what did you lose in applying? Nothing. TAKE THE NON-ZERO CHANCE!"
    },
    {
        "title": "Your resume most likely sucks",
        "text": "If you're writing your professional resume for the first time, follow this template and modify it as needed: https://www.overleaf.com/latex/templates/jakes-resume/syzfjbzwjncs \n\n If you don't like LaTeX, you could find a template on Google Docs or something, but I've been writing my resume in LaTeX since 2019 so I definitely prefer it."
    },
    {
        "title": "Do your best to skip new grad recruiting",
        "text": "Generally you'll be doing 'intern recruiting' while you're in your 1st - 3rd year of university, and when you're taking your 4th / last year courses of university, if you don't have a return offer for a company you interned at or something, you'll be doing new grad recruiting. It's 100% my advice to skip new grad recruiting if you can (have a job lined up for when you graduate). \n\n For point of reference, new grad interviews are much harder than intern interviews. Usually intern interviews consists of 1-2 stages that are typically LeetCode, while new grad interviews can be upwards of 4-5 stages (my Tesla new grad interview had me doing 6 interviews). New grad interviews can include LeetCode, systems design, pair programming, or code review rounds. My LeetCode profile (https://leetcode.com/chrisngyn) as of today has 400 questions solved which was done over the course of 3 years (2019 - 2022). Despite having so much practise, I still failed many new grad interviews because the hiring bar is signficiantly higher (note that I was mainly targetting FAANG / Big N / Unicorn companies, which are harder than smaller / local companies. It's all about what type of company you're hoping to work for). \n\n In my opinion, the optimal strategy is to intern for a company you ideally want to work for full-time in your 3rd year, work really hard, get a return offer, then go back to that company when you graduate after finishing your 4th year of courses. Companies will extend a full-time return offer upon completion of an internship if you'll be graduating within 1 year, but if you're taking longer than that to graduate, you'd most likely be extended a return intern offer (so you'd just intern with them again in the future). \n\n 2022 was a really bad year to graduate as there was a recession and a lot of tech companies weren't hiring (and were doing layoffs + rescinding offers); unfortunately I didn't get end up getting a return offer for Facebook, so I was tossed into the new grad recruiting pool."
    },
    {
        "title": "List of resources",
        "text": "LeetCode - https://leetcode.com \n\n Great website for learning to LeetCode - https://neetcode.io/practice \n\n Levels.fyi - https://www.levels.fyi \n\n Levels.fyi internships - https://www.levels.fyi/internships \n\n Run this query and apply - https://www.google.com/search?q=github+summer+internships"
    },
    {
        "title": "I need motivation, I'm lazy, I don't want to LeetCode, I don't want to apply...",
        "text": "1. If you're lazy, you can stay unemployed. Though, there's a lot of potential and opportunity you're squandering. \n\n 2. Website showcasing some high paying internships: https://www.levels.fyi/internships \n\n 3. Friend interned at Citadel and got a full-time return offer for when he graduates, with a starting salary of $375,000 USD / year (https://www.levels.fyi/companies/citadel/salaries/software-engineer). \n\n 4. I got to travel to Halifax, Vancouver, Seattle, and New York City for work. Other friends got to visit California, Chicago, parts of Europe and Asia, etcetera. If you like travelling, do some international internships. \n\n 5. My internships paid off all my entire student loans. Big money in big tech internships. \n\n 6. Thanks to my internships, when I was recruiting for new grad positions, I got tons of interviews from companies including Google, Apple, Tesla, Bloomberg, Palantir, Okta, IMC, Twitch, Coinbase, Robinhood, Square, etc. \n\n Hop to it!"
    },
    {
        "title": "Generic advice + things to avoid when job searching",
        "text": "1. Don't be overly optimistic. If you apply for a job, just assume you aren't going to hear back, and be pleasantly surprised if you do. Most companies will just ghost / send you a reject months later after applying, and you won't even get a chance to interview. \n\n 2. Don't be discouraged or take anything personally. I sent ~200 applications before I got my first job. Once you get your first job, things become significantly easier as you finally have some experience and your foot in the door. You're going to get a lot of rejections, get used to it. \n\n 3. Don't be spiteful. I'm personally a victim of this no matter how hard, but if everyone around you is getting jobs at Google, Facebook, Apple, etc. and you're the only one not getting any OAs or failing interviews, you're going to start feeling bitter. Just remember that you and your friends are all just trying to do the same thing - find a job. Try not to be upset if your friend announces they got an internship while you still haven't found anything, your time will come. Point is: until it is your time, you will clap for others. \n\n 4. Try to uplevel your career. Maybe your first one or two internships are at a bank, then I'd recommend your next internship be at a larger and more reputable company. This is so that you can get better pay, and learn more (better engineering talent and mentorship at better companies). You most likely won't get Google as your first internship, but you can work at other companies for experience and as a stepping stone first. \n\n 5. Don't be scared of taking an online assessment (OA). Typical interview process might look like: apply > online test / OA > first interview > final interview > offer. That first step cripples a lot of people. It's just a generic coding test, you can practise questions on LeetCode, or if you have a friend who's taken the OA for a company, maybe the questions will be the same. \n\n 6. Acing an OA or an interview doesn't make you special. I've taken a bunch of interview that were steller, went absolutely perfectly, and still got rejected and didn't make it to the next stage. More often than not this is due to being stack ranked with other candidates - let's say a company only wants to hire 10 people, but 15 people end up doing excellently on the interviews. They'll have to stank rank candidates somehow, typically by interview performance and what's on your resume. If I nailed an interview but have no prior experience, and someone else nailed the same interview but worked at Google, I'm probably not getting the job. \n\n 7. Don't beat yourself up: I genuinely and truly mean this but so much of my career has been up to luck. I was just lucky enough to know the right people at the right time, or see a question on an interview I've seen before, or have a friend work at a company and refer me, etcetera. Sometimes all you need is a bit of luck, not everything is in your control. Be resilient and patient, I know recruiting is hard."
    }
]
