[
    {
        "title": "What would I do differently if I was in first year again?",
        "text": "A lot. \n\n To list a few things, I'd start LeetCoding sooner, I'd make more personal projects and put them on GitHub, I'd connect and talk with more alumni to get their knowledge, I'd make friends with people who have similar goals to me, every August I'd commit some time to applying for internships, I'd apply to be a teaching assistant sooner, I'd be more disciplined, fool around less, and work harder in my classes. \n\n Definitely no regrets with where I ended up today; I'm incredibly happy with my success and all the people I've been able to reach and influence, but I think I could've done more had I started sooner. Who knows, maybe in an alternative universe I'm writing this guide saying 'I wish I allowed myself to have more fun and not work so hard all the time'. No point in dwelling!"
    },
    {
        "title": "The difference from honours and non-honours?",
        "text": "First and foremost, before deciding to drop to the non-honours or level up into the honours, talk to academic advising and discuss what would be best for you. Though, they might be subjective and tell you that honours is the best. Make sure you do your own research as well. \n\n On paper, honours has many more requirements and takes 1 extra year as you need 120.0 credits instead of 90.0 credits. Note that if you want to be in the Lassonde co-op program, you need to be in the honours (but you could in theory do what I did, start university being in the honours program, do internships, then later drop to non-honours). Also note that being in their co-op program is not the only way to get an internship (read my co-op and internship section). \n\n It's also important to know that in comparison to other universities, their 'normal computer science degree' is really our 'honours' degree. Yes, some people get caught up thinking that having 'honours' in our title makes us more special, but that's not the case. The 4 year honours degree is really the 4 year 'standard' degree at other universities. \n\n It's actually kind of beneficial that York University allows us to graduate from a 3 year program and give us a degree, considering that in other parts of the world, a 3 year program is considered an associates, not a bachelors. \n\n That last detail is actually very important. Let's say you want to work in America (or any part of the world where you're not a citizen) you need to apply for a work visa, and usually that entails you / your immigration lawyers having to present a package detailing why you are valuable to a country and why you should be granted a work visa. A 3 year program is called an associates, while a 4 year program is called a bachelors. It's unlikely, but there's a possibility a work visa could be declined because you aren't deemed valuable enough to a country having only an associates."
    },
    {
        "title": "The difference from computer science and software engineering?",
        "text": "From what I can understand, the content is mostly the same, they're both about learning how to be a developer. Though, software engineering needs 150.0 credits for the degree, and they have to take more and much harder courses (obviously walking away with more skill and knowledge). \n\n Definitely would say software engineering is the harder degree, but you walk away with a cool engineering ring afterwards. If you've read my note on 'honours vs. non-honours' you'll see I talk about obtaining work visas in other countries. If you had an engineering degree, this is conasidered to be an extremely powerful and valuable degree, and you would have absolutely no problems whatsoever getting a work visa anywhere in the world. Engineers are extremely valuable to any country, and they'd welcome you with a work visa instantly."
    },
    {
        "title": "The difference between bachelors of art and bachelors of science?",
        "text": "In the art variant you'll take more humanities for your electives, and science variant you'll take more science courses for your electives. Same core courses for both parties. I can't really say which one is better than the other since they're 90% the same, but if I had to choose I would lean more towards sciences as I like math and science over writing essays (I am doing the bachelors of science, so there might be some bias). \n\n The best way I can put this is, if you like arts and humanities, the B.A is for you. If you like science and math, the B.Sc is for you. There is absolutely no difference in terms of employability whatsoever."
    },
    {
        "title": "How should I pace myself?",
        "text": "Take courses as needed. There's no need to rush yourself. I hear this a lot: 'I need to take X, Y, Z, A, B, C courses all in the same semester to catch up!' No, you don't. There is no catching up. \n\n You're in university to learn and understand what you're doing, not to get through the degree as fast as possible and leave not knowing anything. In my second year, I was too caught up in this. I wanted to graduate at the same time as my friends - but ultimately taking so many courses at once hurt me a lot more than anything. Yes it sucks to feel like your friends are able to take 5 courses a term while you can only do 4, but it's really about doing what's best for you. \n\n Pace yourself according to your strengths - if you can only manage four courses in a semester, that's fine. If you can only manage three, two, or even one course, that's fine, and it's important you know this. Don't let yourself get caught up in what other people are doing."
    },
    {
        "title": "Should I be worried about not graduating on time?",
        "text": "Technically, computer science honours is a 4 year program. Given you need 120.0 credits, that's 30.0 credits a year, which is 15.0 credits a semester (fall + winter), which is 5 courses a term, for 4 years assuming you take your summers off. If you're in the 90.0 credit program, it's 30.0 credits a year for 3 years instead of 4. You could always take summer school to accelerate these processes. \n\n Despite this, there is no 'graduating on time' in my opinion. Sure, computer science is a 4 year degree, right? So you expect to get it done in 4 years? I've actually met a lot of people who did their computer science degree in 5 or 6 years, and they ended up being a lot happier because of it. Taking your time and knowing you can't handle a standard amount is perfectly fine. Hell, I'll be taking 5 years to do my degree because I want to rack up work experience before I graduate. To reiterate, I'm doing the THREE year degree, and I'm finishing it in FIVE years. \n\n Who cares? Do what's best for you."
    },
    {
        "title": "Is York University a good school for computer science?",
        "text": "To me, the people make up the school. Being surrounded by a lot of smart and talented people means you'll also be smart and talented, is what I believe. Bonus points if the school has a great co-op program with a lot of companies doing partnerships (Lassonde doesn't have partnerships with a lot of companies, on their co-op portal they just upload postings to companies so you don't have to find it yourself, but at Waterloo, companies will specifically make deals to hire X number of Waterloo students a term). \n\n An example of what I would call the best school for computer science is Waterloo because of how masterful their computer science program is - graduating in five years with ~24 months of experience. How? Because between each of their school terms, they make good use of the summers whether it's for taking classes or using it for co-op. It's a great system they got there, but there's no reason you can't do the same at York. \n\n I did find a lot of internships on my own, but it took a lot of due diligence. I wish I met a lot more like-minded people like me to collaborate and work together, but I didn't find that group of people until my 3rd year. I think York also lacks in some departments, like having a poorer curriculum and not being as comprehensive, but you can always fill in the gaps yourself. If you notice a trend, I'm basically saying where York lacks, it's possible to subsidize yourself like I did. \n\n One extremely large advantage that York provides that no other school provides, is the ability to still graduate with a 'bachelors degree in computer science' even if you do the 3 year program (remember, it should actually be called an associates, not a bachelors). So honestly, if you were super smart from the get go, you'd get great internships in your 1st / 2nd year, speedrun your degree, graduate in 3 years, then go work full-time. \n\n Honestly though, I'm pretty happy with my decision to study here - you make the most out of it. If you do just the bare minimum to get your degree and leave you probably won't have the best time. However, I'm very involved in the community, and I love all the friends I've made and feel such a strong sense of camaraderie here."
    },
    {
        "title": "How much math is in computer science?",
        "text": "I asked myself the same thing because I hated advanced functions and calculus, and the good news is that math courses are actually pretty limited. There's calculus I and II, discrete math I and II, and elementary probability (MATH2030) if you're doing the honours degree. If you hate math, you can just power through these courses and be done. \n\n However, a lot of interesting disciplines of computer science (data science, game development, machine learning, computer vision) all rely heavily on math. So, if you want to study a lot of these cool and advanced CS topics, you do need to have a good proficiency in math. If you just want to be a general software engineer (frontend, backend, mobile) then there's not a lot of math involved."
    },
    {
        "title": "Should I do a masters?",
        "text": "The only time I would advocate doing a masters is if you genuinely enjoy academia and want to learn more in a specific field of CS or want to go into teaching. If your train of thought is to do a masters so you can get a higher paying job, that's just flawed. In the two years it takes for you to earn your masters, I'll have worked full-time for 2 years, made a lot of money, my company stocks will have grown, I probably would have promoted once or twice, and I'll be way ahead of someone just beginning to enter the industry despite having a masters. \n\n Only do a masters if you genuinely want to!"
    },
    {
        "title": "Is it bad if my GPA is low?",
        "text": "I've tried to make it abundantly clear that a bad GPA is inconsequential and I've been able to be successful despite my abysmal performance in school. You might want to worry though, that your low grades mean you aren't walking away having properly learnt the required material. \n\n For me, I don't enjoy learning through textbooks and lectures, and have always subsidized my poor grades with extra learning through my own means and pacing, like YouTube videos or Udemy courses. So, walk away with all the Cs and Ds you want as long as you are confident you have learnt / will learn the core concepts of the course you just borderline failed (there IS a minimum GPA requirement to graduate and keep progressing in the degree though; if your GPA is too low they won't allow you to take new courses). \n\n Note that your GPA is very important if you want to go to grad school. Some companies might be biased if you have a low GPA, but realistically, if anyone has ever rejected me because of my low GPA, I most likely wouldn't have enjoyed working there anyways (just leave your GPA off your resume if it's low)."
    }
]
