[
    {
        "title": "Do more outside of your lectures",
        "text": "Many students think that learning is limited to your lectures: you take courses, study, pass, and call it a day. It's my opinion that a computer science curriculum is a skeleton guide of things to learn, but there's significantly more material you should go out of your way to learn on your own time (if you're diligent enough) - and this is what separates people who graduate and struggle to find work, from people who graduate with multiple internships and already have a luxurious offer lined up. \n\n Here's a bunch of things I would add if I was able to change the curriculum: mandatory to learn Git in first year, how to make a fullstack application, how to make a REST API, more group work and collaboration, and so much more. It actually disappoints me with how barebones the York University curriculum is. \n\n Don't wait for university to teach you something, there's a lot of great resources online you can use to teach yourself more. YouTube and Udemy are great places to start."
    },
    {
        "title": "Using your summers wisely",
        "text": "You know how in elementary / high school, when you were done for the year, you got to enjoy your summer for a few months before going back to school? I thought that's how it'd work when I was in university, but realistically, you're just wasting four months of valuable time. \n\n Seriously, use your summers wisely. Whether this means working a software engineering internship, taking summer school to get ahead of the degree, retaking a course for a better grade, or spending the summer learning a new programming language, just use those 4 months and be productive. \n\n In my first year summer, I took a course because I dropped one in the winter term. In my second year summer, I retook 2 courses and took 2 new ones, netting myself 3 As and a B which skyrocketed my GPA. In my 3rd and 4th year, I was interning at Amazon and Facebook respectively."
    },
    {
        "title": "Make friends in your classes",
        "text": "I'm going to say this now - university is not a solo sport. Establish a good group of friends early on since you're bound to see the same people for the next 3-5 years as you're all going through the same degree and classes. \n\n I can confidently say that I wouldn't be where I am without the support of all my friends and everyone I met through my years in computer science. If you're antisocial or in an awkward shell, it's my advice to get out of it. \n\n It's a valuable skill to know how to talk to and establish good rapport with people. Lectures, Discord servers, and school clubs are great ways to start talking to people. Frosh is also a good opportunity to meet a lot of people in your faculty; I liked my frosh so much I was a frosh leader for the next two years as well. \n\n Also, when you get to a point in your career when you're super successful and talented, remember your roots, and remember your friends and who helped you get to where you are. It's lonely getting through life without friends and support, treat those around you kindly!"
    },
    {
        "title": "Stay organized (obviously)",
        "text": "This one is obvious and is in every generic guide you'll find online, but it's true. When you get to a point where you're juggling several courses at a time, trying to make projects, manage your portfolio website, applying to internships, etc. you are really going to get overwhelmed. My first year was abysmal because I just couldn't get my organizational skills down properly. \n\n Do yourself a favour and set yourself up with a productivity stack that works for you - these days I'm using multiple Google Calendars (one for personal and one for work), Cron Calendar to sync multiple calendars, Notion, and Todoist. I also have a private Discord server with multiple channels I use to organize many things - screenshots, links, things to revisit for later, quick reminders for myself, and more."
    },
    {
        "title": "Time management (obviously)",
        "text": "Another obvious one, but yes, knowing how to manage your time is a pivotal part of being a student. You can turn a somewhat easy / medium difficulty course into a hard one if you can't manage your time properly. You can be taking upwards of five or six courses at a time, and if they all have midterms in the same week (or even in the same day) then you need to buckle up. \n\n I used to have horrible gaming habits in high school, and once university hit I knew I had to break those habits. It's pretty dangerous to get good grades in high school without putting in effort, because bad habits carry over. I also had an awful habit of sleeping at 2:00am and skipping my 8:30am lectures because I was so tired. If you also have bad habits and poor time management, you should correct them."
    },
    {
        "title": "The hallmark of a good software engineer",
        "text": "This will be my most opinionated piece, but my take on what makes a great software engineer is curiosity, passion, and the drive to explore further. Let's look at an example with this video: https://www.youtube.com/watch?v=sHDrOlrxjUc \n\n If you were too lazy to open the link, it's a guy who writes Python scripts using image recognition to automate Mario Party minigames. The point I'm trying to bring is not 'be smart enough to know how to do something like this', it's more showing that it's really neat that this guy had a random thought, 'can I use code to beat Mario Party minigames?' explored the idea, and developed it. One of my favourite quotes I've seen online is 'software engineers can literally sit down at a keyboard and create value for people out of thin air' - and it's true! \n\n To end this note, I'll say that being a software engineer isn't knowing how to write code in 10+ languages, it's largely a mindset / how you think type of thing."
    },
    {
        "title": "If you're reading this, make a GitHub and LeetCode account",
        "text": "You're going to spend time making personal projects to showcase your skills as a software engineer and put them on your GitHub to prove you're employable. You're also going to spend a decent amount of time on LeetCode practising your algorithm skills for your interviews. Just do yourself a favour and make those two accounts now."
    },
    {
        "title": "Click if you're feeling demotivated and need kind words",
        "text": "It's okay, genuinely. I know that the degree is bloody hard. I graduated with a C+ GPA, I took calculus II three times before I passed, and I had to take EECS1019, EECS2011, and EECS3311 all twice. I had to retake so many courses, and my transcript is still littered with a plethora of Cs and Ds. At the end of my first year of school, I went to academic advising for help because I was so lost and frustrated, and their advice was to drop out of computer science and major in chemistry instead. I almost dropped out, but I stayed out of spite. \n\n I'm really proud that you're pursuing a degree in computer science! In this day and age, it's one of the most valuable degrees you could graduate with, but also one of the hardest. For me, it finally clicked when I was in 3rd year, where I was lucky enough to meet the right people at the right time, had some good mentors that were patient and willing to teach me, and finally started developing my good habits and learning how I like to learn (this is a thing! Find out how you like to learn - are you a morning person, or a night owl?). \n\n I definitely wouldn't be as successful without all the help I've received over the course of my degree. I'm sure you were accepted into this program for a reason, and you are definitely going to make it if you persevere hard enough and want to succeed as badly as you say you do."
    },
    {
        "title": "Click if you're feeling demotivated and need tough love",
        "text": "I'm going to make this simple - whether it's you wanting to get As in your courses, a FAANG internship, or whatever it is you desire: if you genuinely want it as bad as you say you do, you will achieve it. If you have an infinite sum of energy and you keep hammering away at the same wall, eventually it has to crack. \n\n A lot of people come to me and say 'I want XYZ so bad' or 'how did you get your internships I want to work there too' - no you don't, or, prove it to me. If you want it as bad as you say you do, you'll go and do what it takes for it. \n\n This is one of the degrees where you're awarded the most for your merits - think about being a biology major. You could be really good at biology, and maybe you land yourself in a lab doing research. If you're really good at CS, you can get incredible internships, have opportunities to travel around the world, and so many amazing feats. I got to travel to Seattle and spend a summer interning at Facebook while they paid for my housing, food, got us concert tickets, tickets to sports games, and so much more. You are rewarded for being excellent in this field. \n\n One of my favourite pieces of advice my mentor told me before - stop crying, work harder. The world isn't pausing while you're taking time to recuperate (thank you Jacob)."
    }
]
