[
    {
        "title": "TL;DR Version",
        "text": "(1st year) Fall 2017 school > Winter 2018 school > Summer 2018 school \n\n (2nd year) Fall 2018 school > Winter 2019 school > Summer 2019 school \n\n (3rd year) Fall 2019 school > Winter 2020 school > Summer 2020 MLH Fellowship + TAing for EECS1012 \n\n (4th year) Fall 2020 CaseWare > Winter 2021 MDA Space > Summer 2021 Amazon \n\n (5th year) Fall 2021 Shopify > Winter 2022 took my last courses > Summer 2022 Facebook \n\n Came back after finishing my internship in August, and had my graduation ceremony on October 14, 2022."
    },
    {
        "title": "Fall 2017",
        "text": "First semester of university - took EECS1001, EECS1012, MATH1300, CHEM1000, POLS1000. Getting adjusted to university life. Made a few friends (who I'm still friends with to this day, hi Leo and Dan) and focused mainly on school. I breezed through high school without having to study, so the change of pace was rough. I ended this semester with a pass, A, C+, and A, POLS was year long."
    },
    {
        "title": "Winter 2018",
        "text": "Took EECS1019, EECS1022, MATH1310, CHEM1001, POLS1000. This was a really hard semester since I had the misfortunate of grouping really hard courses together, and having the worst professor in each class. I ended up having to drop MATH1310 and CHEM1001. I went to the Lassonde academic advisors to ask for advice and the person I talked to suggested that I drop out of computer science, and that chemistry was better for me since I had an A in CHEM1000. I almost did, but I stayed in out of spite. I ended this semester with a D+, C, dropped, dropped, and B+."
    },
    {
        "title": "Summer 2018",
        "text": "You know how in high school when it's summer break, you get to enjoy your life for a few months before school starts again? I was thinking that's also how it worked in university, so I didn't make this summer too productive (which is an error my part). I decided to take one course though, CHEM1001, and got an A."
    },
    {
        "title": "Fall 2018",
        "text": "Second year, had an enjoyable first year, couldn't complain. I was behind a bit though as I should've taken MATH1310 but I didn't. I took EECS2001, EECS2030, MATH1310, MATH1090, and MODR1770. Got my ass kicked in MATH1310 again, so I dropped it. Rest of the courses were fine, and ended the semester with a C+, B, dropped, B, and MODR was year long."
    },
    {
        "title": "Winter 2019",
        "text": "My worst semester. I felt really behind all my peers, I couldn't understand / learn concepts as fast as other people who were programming since high school, and overall this semester was awful for my mental. I took EECS2011, EECS2031, EECS2021, and MODR1770. I got a D, D+, A, and A respectively, but those two Ds put me really close to academic probation (dropped me to a 4.6 GPA)."
    },
    {
        "title": "Summer 2019",
        "text": "Winter semester was depressing and dropped my GPA significantly. When summer came I decided to stop moping about it and get my life together, so I took bought a Udemy Python course so I could learn how to code, spent the summer writing a few personal projects and putting them on my GitHub, and I retook three courses this summer (EECS1019, EECS2011, MATH1300). I also took HUMA2200, public speaking, which ended up being my favourite course and one that taught me a lot about how to build rapport with people. I turned 2 Ds and a C into 2 As and a B+ that summer, and got an A in HUMA2200. I made a lot of new friends in my summer courses, worked a part time student IT job where I made even more friends, and overall it was an awesome and productive summer where I grew and matured a lot. I raised my GPA from a 4.6 to a 6.1, which was just barely enough to admit me into the Lassonde internship program (needed a 6.0 minimum)."
    },
    {
        "title": "Fall 2019",
        "text": "This was the semester I went to my first hackathon, Hack the North, which was hosted at the University of Waterloo. Met some talented people who made me envious I didn't have any internships, so I vowed to get my first internship that summer. I took EECS3000, EECS3421, GEOG2030, and ANTH3040. I got a C, B+, A, and ANTH was year long. I also started my first ever job search cycle, I was very inexperienced, and had a lot to learn. I sent out ~100 apps this term and had no luck at all."
    },
    {
        "title": "Winter 2020",
        "text": "Nightmare semester. I took EECS3311, EECS3482, ENG1600, and ANTH3040. Relatively light courseload, but trying to juggle applying to internships, LeetCode, and making side projects - it was really overwhelming. Navigating recruitment season is so hard, especially if you're inexperienced. I sent ~200 applications and heard nothing back. All the jobs I applied to was doing nothing for me. I was applying viciously all of January, February, and March...and it wasn't until the end of March I got an email from CaseWare asking me to take their OA. I took the OA, passed, and got invited to an interview. I was scared and praying - after I took the interview, I got an email saying I got the job! I was going to be a software engineer intern that summer! All that blood, sweat, and tears was worth it. I was able to focus on school for the rest of the semester and ended with a B+, A, pass, and B+. This was also the term when the COVID-19 pandemic started picking up. Around April, school and exams went remote. It was a pretty nice break, and made for easy exams."
    },
    {
        "title": "Summer 2020",
        "text": "This was the summer I was supposed to be doing my first internship at CaseWare, right? Well, because of COVID-19, half the interns got their offer rescinded...which I was one of. You know why this was especially shitty? I got the email they were rescinding my offer two weeks before I was supposed to begin, giving me no time to find another internship, and I actually declined interviews at other companies because I had already signed an offer at CaseWare. Things were looking pretty grim, but there was this program I saw advertised around called the MLH Fellowship by Major League Hacking. It was an internship where you work on open source software, and it was oriented towards students who lost their job because of the COVID-19 pandemic. I applied, got an interview, passed it, and I got this internship miraculously last minute. In the middle of this internship, CaseWare reached out to me asking if I wanted to intern with them during the fall, and I said okay. I signed an 8 month contract, so I'd be with them the upcoming fall and winter semesters. Things ended up okay, but I'll never forget that first week when I found out the news, I was so depressed. This summer was also the first time I was a teaching assistant; I applied to be a TA for EECS1012 and got the job."
    },
    {
        "title": "Fall 2020",
        "text": "Start of my fourth year. I took time off school to be interning with CaseWare, since I wanted more work experience. I was on a frontend team and I hate frontend, so I wasn't particularly enjoying my time working. While interning here I kept applying to more internships, and I got a job at MDA Space for the winter semester...so I told CaseWare I'd be breaking my contract and leaving the company early. They were okay with it and they understood, but Lassonde was upset with me, saying I was unprofessional and ruining the school's reputation with the company. Call me selfish, but I didn't really care. I was just looking out for myself and what was best for me."
    },
    {
        "title": "Winter 2021",
        "text": "I moved to Halifax with one of my friends who also got the job at MDA Space, and we lived together. It was a fun time. Though, I wasn't content with CaseWare and MDA Space on my resume, since I wanted bigger names. Back in November I got an Amazon OA and I wanted it bad. I did 5-6 hours of LeetCode a day, followed a bunch of CS subreddits, connected with a bunch of people and joined many online communities. This was the point in time I found the 'CS Majors' and 'cscareers.dev' Discord servers, the staples of any CS student. It did affect my performance at work since I was doing LeetCode everyday because I had the Amazon interview in February. I took the interview and passed, so now I was en route to working at Amazon in the summer! Around March, I got an interview with Shopify, and I ended up getting the job offer as well for the summer...but I already signed an offer with Amazon. Not wanting to pass up the opportunity, I asked if the offer could be moved to the fall semester, and they said yes. Now I was also en route to working at Shopify in the fall - this would be my 5th internship in a row."
    },
    {
        "title": "Summer 2021",
        "text": "I worked at Amazon, and finally took calculus II (got a C+). I worked remotely from home for Amazon since COVID-19 was still a mess, but I did take a one week trip to Vancouver to hang out with friends who were working there. I met a bunch of other interns (not just from Amazon, but also LinkedIn and Microsoft) and had a really good time. We went to the beach and went drinking every other day, so it made me really sad I didn't choose to work hybrid, since Amazon gave the option of that or to work fully remote. After taking that trip to Vancouver, I wish I worked there instead."
    },
    {
        "title": "Fall 2021",
        "text": "My fifth year (damn I'm getting old). I already decided I'd drop from the 4 year honours program to the 3 year program, so I've effectively taking 5 years now and I still don't have my degree for what's supposed to be a 3 year program. I took too many internships, but with each recruiting season I went through I ended up learning a lot, making new connections, and expanding my network. I worked at Shopify this term and had a good time. At this point, I was 78.0 / 90.0 credits done for my degree, so I just needed 4 more courses until I graduate. I did end up applying to jobs again during my Shopify term, but this time to both new grad and internship roles. The idea was that I'd apply to new grad roles at some companies, but others I'd apply to internship roles, because new grad interviews were much harder and I could 'game' the system a bit. See, a new grad interview cycle at Facebook is 5 stages and an intern interview cycle is 2 stages. So, if you want to new grad at Facebook, you can intern there first, and get a new grad return offer, and skip over new grad interviews if you don't feel confident in your skills to pass them. Speaking of Facebook, I applied and got an offer to intern there next summer, woohoo!"
    },
    {
        "title": "Winter 2022",
        "text": "Took my final courses this semester, EECS3101, EECS3221, PHYS1470, and STS3600. Ended up getting a B+, C, C+, and a C+. Now, I've finished my degree requirements! Although, I did not apply to graduate, as I'm doing an internship with Facebook this summer. When I come back in August, I'll apply for the October convocation."
    },
    {
        "title": "Summer 2022",
        "text": "Had the best summer of my life interning for Facebook in Seattle. It was genuinely amazing, learned so much, had a great time, and met incredible people I'm still friends with to this day. Facebook paid for my housing, all my meals, Ubers around Seattle, they got interns tickets to concerts and sport events, it was an epic time."
    },
    {
        "title": "Finale",
        "text": "After I came home from my internship with Facebook, I mostly had the fall term to relax since I wasn't in school anymore (I finished all my degree requirements earlier, I just had to apply to graduate at this point). I spent a lot of time recruiting and looking for new grad jobs from August - December 2022, I had my graduation October 2022, and I decided to be a EECS1015 TA for the fall term for extra pocket change. \n\n Near the end of 2022, I got a new grad job offer for a company in New York City and signed it, and even though I was mostly applying for new grad jobs, I did apply to a few intern roles for fun. I actually got an interview for Square's winter 2023 internship program, and got an offer from it. I decided to accept it because I wanted to start working around May / June 2023, so working at Square gave me something to do for the January - April period. \n\n To start 2023 off, I interned with Square from January to April. After my internship ended, I went travelling for the month of May, and when I came back home to Toronto, I packed up my life, said bye to my family and friends, and moved to New York City to begin my new grad life. \n\n And with that being said, that brings us to today! I hope my journey gave you some inspiration, and I hope you stick around to see what I end up doing next in my life."
    }
]
